# **Практика 1. Знакомство с библиотекой `pandas`**

[SmartLMS](https://edu.hse.ru/mod/quiz/view.php?id=1574583)

Вам предоставлен датасет про сотрудников одной крупной компании: `job_data.csv`

| Признак             | Описание                                |
| ------------------- | --------------------------------------- |
| Age                 | возраст                                 |
| Gender              | пол (1 — мужчины, 0 — женщины)          |
| Education Level     | уровень образования                     |
| Job Title           | должность                               |
| Years of Experience | опыт работы                             |
| Salary              | заработная плата в год ($)              |
| Country             | родная страна                           |
| Race                | раса (True — белый, False — не белый)   |

In [ ]:
import pandas as pd
df = pd.read_csv('data/job_data.csv')

## **Задание 1**

>*Соотнесите признак и тип данных*

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6699 entries, 0 to 6698
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6699 non-null   int64
 1   Gender               6699 non-null   int64
 2   Education Level      6698 non-null   object
 3   Job Title            6699 non-null   object
 4   Years of Experience  6699 non-null   int64
 5   Salary               6699 non-null   int64
 6   Country              6699 non-null   object
 7   Race                 6699 non-null   bool
dtypes: bool(1), int64(4), object(3)
memory usage: 373.0+ KB

| **Признак**             | **Тип данных**                          |
| ------------------- | ----------------------------------- |
| Age                 | количественный дискретный           |
| Gender              | категориальный номинальный бинарный |
| Education Level     | категориальный порядковый           |
| Job Title           | категориальный номинальный          |
| Years of Experience | количественный дискретный           |
| Salary              | количественный дискретный           |
| Country             | категориальный номинальный          |
| Race                | категориальный номинальный бинарный |

---

## **Задание 2**

>*Укажите количество наблюдений и признаков в данных.*

In [4]:
# вариант 1
df.shape

(6699, 8)

In [6]:
# вариант 2
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6699 entries, 0 to 6698
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6699 non-null   int64
 1   Gender               6699 non-null   int64
 2   Education Level      6698 non-null   object
 3   Job Title            6699 non-null   object
 4   Years of Experience  6699 non-null   int64
 5   Salary               6699 non-null   int64
 6   Country              6699 non-null   object
 7   Race                 6699 non-null   bool
dtypes: bool(1), int64(4), object(3)
memory usage: 373.0+ KB

---

## **Задание 3**

>*Соотнесите признак и формат данных*

In [7]:
df.dtypes

Age                     int64
Gender                  int64
Education Level        object
Job Title              object
Years of Experience     int64
Salary                  int64
Country                object
Race                     bool
dtype: object

| Признак             | Формат данных  |
| ------------------- | -------------- |
| Age                 | целые числа    |
| Gender              | целые числа    |
| Education Level     | строчный (str) |
| Job Title           | строчный (str) |
| Years of Experience | целые числа    |
| Salary              | целые числа    |
| Country             | строчный (str) |
| Race                | логический     |

---

## **Задание 4**

>*Укажите в каком признаке есть пропуски.*

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6699 entries, 0 to 6698
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6699 non-null   int64
 1   Gender               6699 non-null   int64
 2   Education Level      6698 non-null   object
 3   Job Title            6699 non-null   object
 4   Years of Experience  6699 non-null   int64
 5   Salary               6699 non-null   int64
 6   Country              6699 non-null   object
 7   Race                 6699 non-null   bool
dtypes: bool(1), int64(4), object(3)
memory usage: 373.0+ KB

**Ответ**: `Education Level`

---

## **Задание 5**

>*Укажите из какой страны (`Country`) работник, который расположен на 8 строке в датафрейме.*

In [11]:
df.iloc[8]['Country']

'China'

In [13]:
# или
df.loc[7, 'Country']

'China'

In [14]:
# или
df.head(8)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
0,32,1,Bachelor's Degree,Software Engineer,5,90000,UK,True
1,28,0,Master's Degree,Data Analyst,3,65000,USA,False
2,45,1,PhD,Senior Manager,15,150000,Canada,True
3,36,0,Bachelor's Degree,Sales Associate,7,60000,USA,False
4,52,1,Master's Degree,Director,20,200000,USA,False
5,29,1,Bachelor's Degree,Marketing Analyst,2,55000,USA,False
6,42,0,Master's Degree,Product Manager,12,120000,USA,False
7,31,1,Bachelor's Degree,Sales Manager,4,80000,China,False

**Ответ**: `China`

---

## **Задание 6**

>*Укажите какую должность (`Job Title`) занимает сотрудник, который расположен на 10 с конца строке датафрейма.*

In [17]:
df.loc[len(df)-10, 'Job Title']

'Digital Marketing Manager'

In [19]:
# или
df.iloc[-10]['Job Title']

'Digital Marketing Manager'

In [ ]:
# или
df.tail(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
6689,27,1,High School,Digital Marketing Manager,2,40000,Australia,False
6690,33,0,Bachelor's Degree,Content Marketing Manager,7,90000,Australia,False
6691,28,1,PhD,Sales Representative,4,55000,China,False
6692,51,0,Master's Degree,Senior Product Marketing Manager,19,190000,UK,True
6693,37,1,Bachelor's Degree,Junior Sales Representative,6,75000,Canada,False
6694,49,0,PhD,Director of Marketing,20,200000,UK,False
6695,32,1,High School,Sales Associate,3,50000,Australia,False
6696,30,0,Bachelor's Degree,Financial Manager,4,55000,China,False
6697,46,1,Master's Degree,Marketing Manager,14,140000,China,False
6698,26,0,High School,Sales Executive,1,35000,Canada,False

**Ответ**: `'Digital Marketing Manager'`

---

## **Задание 7**

>*Укажите уровень образования сотрудника (`Education Level`) под индексом 1125.*

In [20]:
df.loc[1125, 'Education Level']

"Bachelor's Degree"

In [21]:
df.iloc[1124]['Education Level']

"Bachelor's Degree"

**Ответ:** `"Bachelor's Degree"`